<!DOCTYPE html>
<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
	<meta name="viewport" content="width=device-width, initial-scale=1">
	<title>Portfolio - Резюме</title>
	<link rel="preconnect" href="https://fonts.googleapis.com">
	<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
	<link href="https://fonts.googleapis.com/css2?family=Montserrat:wght@400;700&family=Raleway:ital,wght@0,100..900;1,100..900&display=swap" rel="stylesheet">
	<link rel="stylesheet" type="text/css" href="css/resume-style.css?v=1.02" async>
</head>
<body>
	<div class="content">
		<h1>Резюме</h1>
		<hr />
		<h2>Контакты</h2>
		<p><span><strong>Имя:</strong></span> Олег Дудла</p>
		<p><span><strong>Телефон, Viber:</strong></span> +380983491438</p>
		<p><span><strong>Telegram:</strong></span> @detmetallist</p>
		<p><span><strong>email:</strong></span> det.metallist85@gmail.com</p>
		<hr />
		<h2>Скиллы, стек технологий:</h2>
		<p><strong>Сайты, лендинги, скрипты</strong> - php, mysql, js (в основном jquery), html, css</p>
		<p><strong>Роботы для автоматизации действий в интернете (парсеры, автонаполнители контента, регеры, фоловеры и т.п.)</strong> - zennoposter, Browser automation studio, nodejs</p>
		<p><strong>Торговые роботы под крипту</strong> - nodejs, Binance API, Bybit API и API других бирж</p>
		<p><strong>Торговые роботы под Forex</strong> - metatrader + mql</p>
		<p><strong>Приложения для Windows</strong> - Delphi, c++</p>
		<p><strong>Роботы под Android</strong> - ZennoPoster + c# + NOX</p>
		<hr />
		<h2>Образование:</h2>
		<p>2002-2007 - ЗИГМУ - Системный анализ и управление, диплом специалиста</p>
		<hr />
		<h2>Опыт работы:</h2>
		<p>2004-2008 - программы на Delphi и c++ для студентов (для дипломных и курсовых работ) через заказчика-посредника</p>
		<p>2008-2014 - работы не по специальности (сначала продажи и блочные+программные ремонты компов, потом в локомотивном депо электронщиком, потом там же сисадмином на парк около сотни компов)</p>
		<p>2014 по сегодня - фриланс, чередующийся с работой на постоянных заказчиков по удалёнке - сайты, лендинги, парсеры и всякие разные боты</p>
		<hr />
		<h2>О себе:</h2>
		<p>Люблю изобретать велосипеды. Например на слайдер на сайте портфолио скорее всего существуют готовые решения. Но мне их было так лень искать, что я взял этот слайдер и просто написал со всеми внутренностями. То же самое касается 90% моих проектов</p>
		<p>В студенческие годы написал на Delphi синтезатор, на котором можно было расставлять матрицу нот и автоматически проигрывать, с подгружаемыми наборами звуков. Потом узнал об FL студии и подобных вещах и мой синтезатор стал не нужен. Увлекаюсь музыкой, пишу метал.</p>
		<p>Автоматизирую всё что связано с рутиной. Например когдато для себя писал роботов для массфоловинга и масслайкинга в твиттере и инстаграме - чтото под веб, чтото под андроид. Под фринас биржу делал робота автоответчика. Он постоянно парсил по кругу первую страницу фриланса, фильтровал заголовки и тексты по нужным мне параметрам и если заказ под фильтры подходил, то писал первое сообщение. В результате я общался только с заинтересованными заказчиками, не трятя время на поиск заказов</p>
	</div>
</body>
</html>